# Titanic Accident Passenger Analysis

## Name Surname: Gizem GÃ¶ksu

## Department: Istanbul Technical University Mathematical Engineering

In [153]:
import numpy as np
import pandas as pd

In [155]:
df = pd.read_csv("Titanic_dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [157]:
df.shape

(891, 12)

In [159]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [161]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- Functions and data frames that will be used in forward analysis.

In [164]:
def filter_df(df, **kwargs):
    for col, val in kwargs.items():
        df = df[df[col] == val]
    return df

In [166]:
not_survived = filter_df(df, Survived=0)
survived = filter_df(df, Survived=1)

w_not_survived = filter_df(not_survived, Sex="female") # women that died in the accident
m_not_survived = filter_df(not_survived, Sex="male") # men that died in the accident

1) Mean of age of people who died in the accident:

In [169]:
not_survived["Age"].mean()

30.62617924528302

2. Mean and median of fare of people who died in the accident:

In [172]:
def calculate_fare_statistic(df):
    mean = df["Fare"].mean()
    median = df["Fare"].median()
    print("Fare mean:",mean)
    print("Fare median:",median)
    return [mean,median]

In [174]:
print("For people that died in the accident:")
calculate_fare_statistic(not_survived)

For people that died in the accident:
Fare mean: 22.117886885245902
Fare median: 10.5

[22.117886885245902, 10.5]

3. Mean age of men who died in the accident:

In [177]:
m_not_survived["Age"].mean()

31.618055555555557

4. Mean age of women who died in the accident:

In [180]:
w_not_survived["Age"].mean()

25.046875

5. Mean age of people who survived from the accident:

In [183]:
survived["Age"].mean()

28.343689655172415

6. Mean and median of fare of people who survived from the accident:

In [186]:
print("For ones that survived from the accident")
calculate_fare_statistic(survived)

For ones that survived from the accident
Fare mean: 48.39540760233918
Fare median: 26.0

[48.39540760233918, 26.0]

7. Number of the people that survived:

In [189]:
survived.shape[0]

342

8. Median of fare of people that are younger than 10:

In [192]:
df[df["Age"]<10]["Fare"].median()

27.0

9. Pclass comparison on median and median of fare:

In [195]:
stats = ["mean", "median"]

res_df = df.groupby("Pclass")["Fare"].agg(stats)
display(res_df)

for stat in stats:
    max_idx = res_df[stat].idxmax()
    min_idx = res_df[stat].idxmin()
    print(f"Pclass {max_idx} has maximum {stat} with {res_df[stat][max_idx]}")
    print(f"Pclass {min_idx} has minimum {stat} with {res_df[stat][min_idx]}")

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

Pclass 1 has maximum mean with 84.1546875
Pclass 3 has minimum mean with 13.675550101832993
Pclass 1 has maximum median with 60.287499999999994
Pclass 3 has minimum median with 8.05

10. Death ratio comparison for women and men passengers:

In [198]:
w_ratio = w_not_survived.shape[0] / filter_df(df, Sex="female").shape[0]
m_ratio = m_not_survived.shape[0] / filter_df(df, Sex="male").shape[0]

if w_ratio > m_ratio:
    print(f"women death ratio = {w_ratio} > men death ratio = {m_ratio}")
elif m_ratio > w_ratio:
    print(f"men death ratio = {m_ratio} > women death ratio = {w_ratio}")
else:
    print(f"male death ratio = {m_ratio} = women death ratio = {w_ratio}")

men death ratio = 0.8110918544194108 > women death ratio = 0.25796178343949044